var keynotes = [
  {
    banner: "../resource/keynote/keynote-wangwei-banner.png",
    avatar: "../resource/keynote/wangwei.png",
    intro:
      "曾为国内外电信设备制造、电信运营商、金融、能源、电子商务等一线企业提供敏捷转型、架构重构、架构评估、微服务架构咨询服务。先后主导参与了若干个微服务架构转型项目。",
    topic: "统一语言的复兴",
    des:
      "在领域驱动设计的理论体系中，统一语言是所有实践的核心。实践往往证明，语言本身是脆弱的且易腐化的。这种特性既体现在新建系统中发现统一语言的不易，也体现在遗留系统中逐步重新挖掘统一语言的艰难。经过了大量的实践之后，很多团队不仅已经意识到通过充分的协作来发现和维护统一语言，是领域驱动设计成功的关键，并且已经在尝试采用不同手段，来加固这一过程。\n在今年的开幕演讲中，王威将带领大家开启统一语言的探索之旅，希望能够使听众体会到统一语言的在实践过程中的重要性。同时，也希望在本届领域驱动设计大会过程中，和听众一起来发现协作设计和企业架构的统一语言。"
  },
  {
    banner: "../resource/keynote/keynote-xiaoran-banner.png",
    avatar: "../resource/keynote/xiaoran.png",
    intro:
      "ThoughtWorks 创新设计总监,国内最早的敏捷精益方法实践者，适应性领导力及领域驱动架构方法首席讲师及教练。作为咨询顾问长期辅导国内外知名企业进行精益企业的建设，近期在多个大型开发团队推广领域驱动设计方法及微服务架构。      ",
    topic: "数字化世界不断拓展的“设计域”",
    des:
      "从物理世界到数字化世界，设计的问题域一直在被持续认知。人类既是数字化世界的用户，也是新世界的造物主，于是我们有了更大的权限，让设计更快的迭代和进化。结合DDD和核心概念，让我们一起从设计的角度来看看数字化世界里浮现出来的“设计域”！"
  },
  {
    banner: "../resource/keynote/keynote-zhangyi-banner.png",
    avatar: "../resource/keynote/zhangyi.png",
    intro:
      "架构编码实践者，IT文艺工作者，大数据平台架构师，兼爱OO与FP，热衷于编程语言学习与技艺提升，致力于将主流领域驱动设计与函数式编程、响应式编程以及微服务架构完美结合。 张逸的个人微信公众号为「逸言」。",
    topic: "构建全新的领域驱动设计知识体系",
    des:
      "从上个世纪九十年代Eric Evans提出领域驱动设计至今，随着软件工程理论和实践的发展，领域驱动设计在逐渐得到业界认同与重视的同时，它的知识体系也需要做出相应调整和梳理，以满足新形势下软件研发的技术发展趋势，帮助企业在领域驱动设计方面建立软件研发团队的能力评估标准与能力培养体系。\n本次主题演讲提出了构建全新的领域驱动设计知识体系的设想，分别以宏观和微观的层次剖析领域驱动设计需要具备的知识与方法，实施领域驱动设计时需要遵循的研发过程与原则，并广泛吸纳从项目管理、需求分析到架构、设计、开发、测试等各个阶段的最佳实践，结合当前实施领域驱动设计的难点和挑战，基于领域驱动设计知识体系建立领域驱动的能力成熟度评估模型，确定团队的能力培养路线图，并帮助企业构建面向行业的领域知识与领域模型资产。"
  },
  {
    banner: "../resource/keynote/keynote-anita-banner.png",
    avatar: "../resource/keynote/anita.png",
    des:
      "火星是人类在太阳系及以外的宇宙中探索和定居的下一个目的地。在过去的30年中，许多国家的太空计划一直在发射越来越复杂的登陆平台，不断揭示这个红色星球的古老历史。所有火星任务都面临的一项突出挑战就是：如何以每小时30,000英里的最初进入速度实现安全的软着陆。在下降到地面的过程中，复杂的工程系统可保护机器人以及人员免受极端温度和重力的影响。表面看来，未来的勘探者必须能够在只携带有限资源的情况下承受辐射和低压。本讲座将讨论火星探索的动机，以及如何通过计算建模，尖端技术和即时即用的思维解决工程难题。探索红色星球是我们迎接未来以及了解过去的关键。",
    topic: "火星探索的未来",
    intro:
      "Anita Sengupta博士是一名火箭科学家和航空航天工程师。过去20年间，她一直在开发用于探测火星，小行星和外太空的宇宙飞船技术。她的职业生涯始于运载火箭和通信卫星领域。在攻读博士期间，她的研究重点是开发离子发动机，为曙光号（Dawn）太空船提供动力，以便到达在主要的小行星带上的灶神星和谷神星。之后，她负责超音速降落伞系统，该系统是好奇号（Curiosity Rover）火星车在火星上降落所不可或缺的。她最近领导了冷原子实验室的开发，这是一个激光冷却量子物理设施，于2018年发射到国际空间站，创造了已知宇宙中最冷的地方。目前，她走在下一代技术开发的前沿，展开对太阳系的进一步探索并将太空技术带到地球。凭借作为南加州大学研究教授和Hyperloop One高级副总裁的渊博学识，Sengupta博士将从世界知名的科学传播者这一独特视角分享她的专业知识。Sengupta博士在南加州大学获得航空航天工程硕士和博士学位。在业余时间，她是一名狂热的飞行员，摩托车手，潜水员，山地自行车手和STEM倡导者。"
  }
];
