var producers = [
  {
    "producer-img": "../resource/zhuao.png",
    "producer-name": "朱傲",
    "producer-introduction": "戴姆勒大中华区高级架构师",
    "producer-information":
      "专注于在企业内推动技术对业务的赋能，实现技术价值最大化。曾就职于ThoughtWorks，期间帮助多个企业完成其服务平台的设计及规划。行业覆盖汽车，零售，电信，云平台等领域。",
    "producer-topic": "领域驱动的架构演进",
    "topic-information":
      "过去的5年中，领域驱动设计在架构设计过程中的重要作用逐渐被业界主流所接受。无论是微服务架构、演进式架构、还是企业IT架构设计、企业中台设计，我们都可能看到领域驱动设计在各个架构设计层面发挥着自己的价值。我们希望通过本论坛的研讨，为听众呈现一场架构设计的盛宴，让大家能全方位的理解领域驱动设计的价值和威力"
  },

  {
    "producer-img": "../resource/qianbingqin.png",
    "producer-name": "钱冰沁",
    "producer-introduction": "ThoughtWorks高级用户体验设计师",
    "producer-information":
      "ThoughtWorks 资深用户体验设计师与咨询师，IxDC讲师，译有《3D用户设计：设计与评估》一书，设计背景与相关⼯作经验横跨产品、服务与用户调研领域，专注于透过系统思维去分析产品与服务系统所建构出的脉络，挖掘用户洞察，并透过整合用户体验、商业和技术三个维度的设计流程，找寻到机会点。精通服务设计与设计思考方法，也拥有多个行业经验，所经历项目涵盖金融、旅游、电信、零售等行业。也曾经游历世界50多个国家，对不同文化设计有着特殊的见解。",
    "producer-topic": "领域驱动的协作设计",
    "topic-information":
      "领域驱动设计的概念和相关实践被社区广泛采纳之后，尤其是事件风暴工作坊的流行，再一次证明了协作设计在软件开发过程中的巨大作用。在本分论坛中，我们希望从不同视角审视协作设计的过程，这种协作设计可能是架构设计，也可能是产品设计、交互设计、代码设计"
  },
  {
    "producer-img": "../resource/zhangyi.png",
    "producer-name": "张逸",
    "producer-introduction": "编码实践、加固设计、领域驱动实践领先者",
    "producer-information":
      "架构编码实践者，IT文艺工作者，大数据平台架构师，兼爱OO与FP，热衷于编程语言学习与技艺提升，致力于将主流领域驱动设计与函数式编程、响应式编程以及微服务架构完美结合。 张逸的个人微信公众号为「逸言」。",
    "producer-topic": "领域驱动的统一语言",
    "topic-information":
      "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
  }
];
