var speakers = [
  [
    {
      "producer-img": "../resource/speakers/huhao.png",
      "producer-name": "胡皓",
      "producer-introduction": "ThoughtWorks 高级咨询师",
      "producer-information":
        "擅长于全栈软件开发、端到端交付、面向对象设计、测试驱动开发、持续集成/持续交付，领域驱动设计、整洁架构、微服务、DevOps、Scrum、Kanban以及其他的技术和方法论。当前，正深耕于领域驱动设计、微服务、中台战略，并致力于帮助ThoughtWorks的客户实现数字化转型",
      "producer-topic": "实战化领域驱动设计工作坊",
      "topic-information":
        "“实战化领域驱动设计工作坊”基于ThoughtWorks所总结的“基准化”方法，从一个沙盘业务场景出发，通过问题澄清、业务抽象、统一语言、问题域划分、领域建模，由一线咨询师带您一步步体验从DDD战略设计到战术设计再到指导技术实现的全流程。"
    },
    {
      noTopic: true,
      "producer-information": "...",
      "producer-topic": "...",
      "topic-information": "..."
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/wangyan.png",
      "producer-name": "王岩",
      "producer-introduction": "ThoughtWorks 高级咨询师",
      "producer-information":
        "先后从事全栈开发工程师、技术经理、顾问等工作。在技术领域，专注于测试驱动开发、持续集成/持续交付，领域驱动设计，整洁架构，微服务，Devops 等方向。最近一年，主要服务于保险行业，专注于大型遗留项目的拆分。",
      "producer-topic": "实战化领域驱动设计工作坊",
      "topic-information":
        "“实战化领域驱动设计工作坊”基于ThoughtWorks所总结的“基准化”方法，从一个沙盘业务场景出发，通过问题澄清、业务抽象、统一语言、问题域划分、领域建模，由一线咨询师带您一步步体验从DDD战略设计到战术设计再到指导技术实现的全流程。"
    },
    {
      noTopic: true,
      "producer-information": "...",
      "producer-topic": "...",
      "topic-information": "..."
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/kangjiangmei.png",
      "producer-name": "亢江妹",
      "producer-introduction": "ThoughtWorks精益产品创新咨询师、首席商业分析师",
      "producer-information":
        "十八年从业经验，在敏捷/精益产品需求分析、大企业需求管理、行业研究等方面，有丰富的实战和教练经验；她也是业务分析师(IIBA)、产品经理的活跃参与者，是DnA(Design and Analysis)社区、ThoughtWorks中国行业研究社区的发起人，也是ThoughtWorks商业洞见的主编。",
      "producer-topic": "业务中台建设实例",
      "topic-information":
        "XX电信运营商业务中台规划设计、落地启动过程中的种种挑战，以及我们如何应对的实践经历：</br>*业务和IT并没有真正理解中台；</br>*业务和IT如何从过去的部门割裂中转变为紧密协作；</br>*如何通过业务规划设计和中台落地倒逼业务部门打破条线壁垒，横向贯通；</br>*如何把多渠道向全渠道转型及体验优化、营销业务、政企业务、新型数字化服务业务等多条线繁杂的业务诉求进行纵向切片，让中台产品敏捷落地；</br>*如何协同业务设计、前台应用设计、中台技术设计等以迭代式协同推进。"
    },
    {
      "producer-img": "",
      "producer-name": "",
      "producer-introduction": "",
      "producer-information": "",
      "producer-topic": "领域驱动的协作设计",
      "topic-information":
        "作为IT系统治理和架构治理的一种工具，企业级架构被很多大型企业广泛采用。但在实际工作当中，企业级架构的定义和治理如何能够和快速变化的业务诉求相匹配，与快速创新的企业愿景相一致，这些问题一直有待解决。DDD作为一种面向响应力的软件和系统设计原则，在企业架构实践中大有用武之地。本专题将专注讨论领域驱动的企业级架构的设计方法和实践。"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/wangjian.png",
      "producer-name": "王健",
      "producer-introduction": "ThoughtWorks首席咨询师",
      "producer-information":
        "一直从事国内外大型企业级软件的设计与开发，保持着对技术的热爱，享受着编码的快乐，热衷于技术分享，阿里云MVP。十年前开始接触DDD，一直在工作中运用与不断学习。近两年关注在应用DDD进行大型企业企业数字中台规划与落地，平台化建设，遗留系统服务化相关工作。",
      "producer-topic": "业务中台建设实例",
      "topic-information":
        "XX电信运营商业务中台规划设计、落地启动过程中的种种挑战，以及我们如何应对的实践经历：</br>*业务和IT并没有真正理解中台；</br>*业务和IT如何从过去的部门割裂中转变为紧密协作；</br>*如何通过业务规划设计和中台落地倒逼业务部门打破条线壁垒，横向贯通；</br>*如何把多渠道向全渠道转型及体验优化、营销业务、政企业务、新型数字化服务业务等多条线繁杂的业务诉求进行纵向切片，让中台产品敏捷落地；</br>*如何协同业务设计、前台应用设计、中台技术设计等以迭代式协同推进。"
    },
    {
      "producer-img": "../resource/speakers/wangjian.png",
      "producer-name": "王健",
      "producer-introduction": "",
      "producer-information": "",
      "producer-topic": "领域驱动的协作设计",
      "topic-information":
        "2014年，微服务概念的火热带动了DDD的概念被业界重新认知。在微服务架构设计中，DDD被认为是微服务架构设计的指导思想。我们将继续关注业界是如何通过领域驱动设计的方法，来指导微服务架构的落地和实践的。同时，我们也更加关注服务网格（Service Mesh)等最新技术实践，及其给服务设计带来的影响。"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/gaoyikai.png",
      "producer-name": "高翊凯",
      "producer-introduction": "Amazon Web Services 解决方案架构师",
      "producer-information":
        "Kim Kao (高翊凯)目前是DDD Taiwan Community共同发起人之一，同时任职于Amazon Web Services 担任解决方案架构师，一直对于各种软体开发方法论感到兴趣，尤以领域驱动设计为最，在职涯初期就投入了大量的Java EE 应用程序开发，始终对于分散式系统的话题特别留心，并前后担任过程序员、系统分析师、项目经理、软件架构师，以至于解决方案架构师。随著云服务的大规模的发展日盛，过往複杂难解的技术与商务问题能够更好的被解决并提供夜价值，现在正努力的协助客户将既有遗留系统搬迁上云，通过领域驱动设计的辅助以及其他敏捷实践可以带来帮助。",
      "producer-topic": "微服务背后的见微知著",
      "topic-information":
        "微服务的热潮席捲了整个IT产业，不管是哪一种产业都很想要在这样的系统架构中得到好处，然而，事情并没有像想像中的这样简单，在走入微服务前我们经常会碰到一些问题，像是如何拆分系统边界? 或者是拆分后业务价值能真的满足既有需求? 以及拆分后的交易管理议题怎么做? 能否有更为优雅一点的方式来处理? 在这个演讲当中，讲者(Kim Kao)将针对过去两年来实际看到的一些经典问题做了整理，并介绍如何通过AWS的一些重要产品与领域驱动设计思维，帮助大家更好的解决这些困难。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的架构演进",
      "topic-information":
        "过去的5年中，领域驱动设计在架构设计过程中的重要作用逐渐被业界主流所接受。无论是微服务架构、演进式架构、还是企业IT架构设计、企业中台设计，我们都可能看到领域驱动设计在各个架构设计层面发挥着自己的价值。我们希望通过本论坛的研讨，为听众呈现一场架构设计的盛宴，让大家能全方位的理解领域驱动设计的价值和威力"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/wangbo.png",
      "producer-name": "王博",
      "producer-introduction": "独立软件技术顾问",
      "producer-information":
        "软件技术咨询师，全栈程序员。专注于大型系统软件的领域建模设计、重构、持续交付以及服务化、智能化架构演进等领域。曾深度参与无线通讯4G、5G核心系统、自动驾驶、云存储、人工智能对话平台等咨询和创业项目。",
      "producer-topic": "嵌入式C系统如何重构到领域模型",
      "topic-information":
        "嵌入式C系统由于系统约束、语言能力和人员技能等各种原因，大多直接采用面向过程的设计方式，导致代码很难和领域模型建立起清晰的映射关系。为了能在嵌入式C系统中实施领域驱动设计，提高嵌入式C系统的可理解和应对变化的能力，我们给出一套嵌入式C语言的设计和重构方法，以支持领域建模过程。本演讲通过一个实际的案例，讲述嵌入式C系统中实施领域驱动设计的相关经验总结。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的架构演进",
      "topic-information":
        "过去的5年中，领域驱动设计在架构设计过程中的重要作用逐渐被业界主流所接受。无论是微服务架构、演进式架构、还是企业IT架构设计、企业中台设计，我们都可能看到领域驱动设计在各个架构设计层面发挥着自己的价值。我们希望通过本论坛的研讨，为听众呈现一场架构设计的盛宴，让大家能全方位的理解领域驱动设计的价值和威力"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/fengwenhui.png",
      "producer-name": "冯文辉",
      "producer-introduction": "ThoughtWorks高级咨询师",
      "producer-information":
        "现任ThoughtWorks中国区资深架构咨询师。工作期间为多个海外交付项目包括某500强大型跨国外资银行网上银行系统，国际贸易交易担保系统，企业大宗买卖交易担保系统，内部工作流系统，文档管理系统，即时支付系统，社交化银行系统的开发，测试，部署，运维工作。拥有团队全角色经验，熟悉大型复杂IT系统的架构设计。也曾主动和带领公司内的百人移动开发部门的敏捷转型和DevOps能力提升工作。熟悉敏捷，精益等软件开发方法论，熟悉Scrum，Kanban等项目和流程管理方法，熟悉DevOps，对其价值观，原则和套路有深刻的理解，深知IT组织变革的困难与痛点，也总结了其中的经验与教训。熟悉领域驱动设计方法论，曾多次主导客户DDD工作坊，对如何利用DDD进行架构的解耦与演进有独特的洞察与看法。目前正在探讨企业架构与IT战略规划，寻求更好的方法使企业的业务架构，应用架构、数据架构与技术架构保持一致，以及宏观的架构设计如何能正确传导到代码实现，从而使得IT在数字化转型的大潮下能真正成为引领业务发展的引擎。",
      "producer-topic": "By Experience的三个层次",
      "topic-information":
        "By Experience 往往是架构设计的Golden Rule。虽然DDD的方法一直想通过一些原则和套路把架构设计对经验的依赖弱化，但是很难做到完全不依赖经验。相反的是，有时候经验往往更是整个架构中最精髓的一笔。本演讲将以一些DDD实战的例子，从By Experience，By Crystallized Intelligence，By Human阐述三个凭经验的层次，从社会学，到心理学，最后希望从哲学的角度合理解释By Experience的不可避免，却又不可或缺。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的协作设计",
      "topic-information":
        "领域驱动设计的概念和相关实践被社区广泛采纳之后，尤其是事件风暴工作坊的流行，再一次证明了协作设计在软件开发过程中的巨大作用。在本分论坛中，我们希望从不同视角审视协作设计的过程，这种协作设计可能是架构设计，也可能是产品设计、交互设计、代码设计"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/dalei.png",
      "producer-name": "笪磊",
      "producer-introduction": "ThoughtWorks数字化转型顾问",
      "producer-information":
        "ThoughtWorks数字化转型顾问、工程与项目管理硕士，十多年互联网、大型IT组织从业经验，专注于大型组织数字化、敏捷与精益转型、创新产品孵化等方向，主要服务于通信、银行、互联网等行业的头部客户，并致力于以科学的方法和严谨的态度帮助客户达成组织数字化变革的实践成效。",
      "producer-topic": "如何运用DDD构建数字化平台",
      "topic-information":
        "从业务出发，从办公环境和协同平台入手，介绍如何运用DDD构建数字化协作设计平台，讲述这样的方式可以给组织的数字化变革带来什么样的变化。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的协作设计",
      "topic-information":
        "领域驱动设计的概念和相关实践被社区广泛采纳之后，尤其是事件风暴工作坊的流行，再一次证明了协作设计在软件开发过程中的巨大作用。在本分论坛中，我们希望从不同视角审视协作设计的过程，这种协作设计可能是架构设计，也可能是产品设计、交互设计、代码设计"
    }
  ],

  [
    {
      "producer-img": "../resource/speakers/wanxuefan.png",
      "producer-name": "万学凡",
      "producer-introduction": "ThoughtWorks华东区交付总监",
      "producer-information":
        "首席咨询师、资深管理顾问。TGO鲲鹏会武汉分会会长。学凡曾先后为多家知名企业的产品研发机构及IT组织提供咨询服务。在数字化转型，打造敏捷组织，敏捷项目管理和构建数字化人才体系上都有深刻的理解。学凡的个人微信公众号为「其识」。",
      "producer-topic": "如何运用DDD构建数字化平台",
      "topic-information":
        "从业务出发，从办公环境和协同平台入手，介绍如何运用DDD构建数字化协作设计平台，讲述这样的方式可以给组织的数字化变革带来什么样的变化。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的协作设计",
      "topic-information":
        "领域驱动设计的概念和相关实践被社区广泛采纳之后，尤其是事件风暴工作坊的流行，再一次证明了协作设计在软件开发过程中的巨大作用。在本分论坛中，我们希望从不同视角审视协作设计的过程，这种协作设计可能是架构设计，也可能是产品设计、交互设计、代码设计"
    }
  ],

  // update
  [
    {
      "producer-img": "../resource/speakers/zhangxiaolong.png",
      "producer-name": "张晓龙",
      "producer-introduction": "中兴通讯 资深软件架构师",
      "producer-information":
        "资深软件架构师，敏捷技术教练，DDD实践布道师，GitChat认证作者，go语言gomonkey和trans-dsl作者，具有十多年软件架构和开发经验。近年来专注于PaaS和5G等大型项目的设计和开发，尤其精通微服务契约测试。爱读书，爱运动，爱编程，爱分享，对于大型软件的重构具有丰富的实战经验。曾指导多个团队积极实践 DDD，包括开发领域和测试领域，取得了比较好的效果。个人简书主页：https://www.jianshu.com/u/1381dc29fed9 ，个人 GitHub 主页：https://github.com/agiledragon，已发布多场高质量Chat。",
      "producer-topic": "当 DDD 遇上 DSL",
      "topic-information":
        "DDD是一种主流的软件开发方法，DSL是一种针对某一特定领域且具有受限表达性的计算机设计语言，当DDD遇上DCI会擦出什么样的火花？我们将结合典型案例一起探讨，共同成长，从而有效降低开发成本。命令/查询式API是一种常见的领域模型的组装方式，但在复杂场景下，内部或外部DSL是一种更好的选择。DSL是在领域模型上增加了薄薄的一层外壳，可以增强领域模型的能力，是对领域模型的一个有益补充。DSL既可以提升开发人员的生产力，又可以增进开发人员与领域专家的沟通。 三个典型案例：（1）gomonkey1.0是命令式API，支持各种简单场景的打桩，但应对复杂场景的能力弱，所以计划在gomonkey2.0时通过表达式构造器提供完备的内部DSL，以便满足用户的高阶诉求；（2）流程契约通过外部DSL来描述，与具体的编程语言无关，同时又可以自动化生成流程图，大大降低了用户开发流程契约的成本；（3）在实时性和并发性要求比较高的系统中，消息处理是异步模型，业务实例的状态机很复杂，而且很多状态都是临时的，这时使用事务模型可以极度简化业务实例的状态机，仅保留业务实例的本质状态。事务DSL可以是内部的，也可以是外部的，主要根据宿主语言的特点而定。通过事务DSL定义事务，可以集中表达业务的行为交互，且与流程图一一对应，构成了事务层，演进了分层架构。每个业务行为分别组装领域模型且是正交的，可以在多个业务流程中复用。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的统一语言",
      "topic-information":
        "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/zhangguozhao.png",
      "producer-name": "张国昭",
      "producer-introduction": "MXItech 项目经理",
      "producer-information":
        "目前在MXITech服务,担任项目经理一职。数年前接触DDD之后就为之著迷,并且一直研究到现在。为此,于今年初与朋友(Kim)在台湾创办DDD TW社群,并营运至今。我们办过多场Meetup以及iDDD的读书会,我亦在其中分享和引导对DDD有兴趣的朋友们熟悉DDD。",
      "producer-topic": "DDD开发实务-整合战略与战术",
      "topic-information":
        "DDD实践分为战略和战术两个环节,在战略环节上,团队无法有效率地获得领域知识,并且对于DDD中的领域和限界上下文不甚理解;这些都会造成团队无法正确划分子领域,以及产出限界上下文地图,因此,团队很容易会想要略过战略环节,直接进入到战术环节。由于没有战略的分析和辅助,导致团队资源投资错误,除此之外,DDD战术中的许多样式及其应用也是团队在导入DDD时候的困难,并且,DDD在经过时间打磨之下,也已经融合了新的开发概念,这更加让团队为之却步。对于上述的问题,需要有一个可行的方法去学习和实现DDD的战略到战术。从一开始的冷域知识学习,到子领域划分与限界上下文地图的产出,并且藉由通用语言协助战术上的建模,并综整其它战术的样式。从事件风暴或是故事讲(StoryTelling)获取领域知识,并且蒐集和分析不变条件。团队藉由影响力地图锚定商业目标和关键路径,以此划分和定义核心子域,并且将限界上下文配置到不同子域中,分析限界上下文之间的关系,以产出限界上下文关系地图。将团队资源投注在核心子域上,并且由核心子域中的限界上下文的通用语言协助建模,导出聚合及其它战术样式的整合,并依照限界上下文的关系调整代码实现。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的统一语言",
      "topic-information":
        "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/yanhua.png",
      "producer-name": "阎华",
      "producer-introduction": "京东7FRESH 系统架构负责人",
      "producer-information":
        "阎华，京东 7FRESH系统架构负责人，京东零售子集团技术专家委员会成员，拥有超过15年的软件开发和设计经验，一直致力于探索系统复杂性应对之道。最近两年负责了生鲜电商平台7FRESH的应用系统的整体架构设计工作，对微服务和DDD等架构风格进行了深入而有益的尝试。",
      "producer-topic": "中台系统建设让值对象无法再被忽视",
      "topic-information":
        "近两年在京东的7FRESH系统的构建过程中，使用DDD去做系统的设计以及和中台系统的集成。发现大家普遍缺乏面向对象的建模思想，还是以表结构驱动的建模，其中最突出的一点是通过外键对其他上下文的引用导致的耦合。本次分享会探讨如何用值对象来解决这个问题，包括建模的思路和落地到编码的细节"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的统一语言",
      "topic-information":
        "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/zhurumeng.png",
      "producer-name": "朱如梦",
      "producer-introduction": "某高科技制造业企业 业务架构师",
      "producer-information":
        "2005年硕士研究生毕业后加入某高科技制造业企业，从事流程管理和变革等方面的工作，积累了丰富的项目经验和领域知识。2015年至今，主要从事业务架构方法研究和企业级业务架构实践。目前是BA GUILD认证的业务架构师（Certified Business Architect），并在BA GUILD制造业参考模型开发小组中担任成员和主要贡献者。",
      "producer-topic": "业务架构——跨领域的统一语言",
      "topic-information":
        "DDD方法强调构建领域内的统一语言，但企业很可能会同时在多个领域开展多个变革项目。如果每个领域都分别构建自己的统一语言，那么多个项目之间如何协调？引入业务架构，有助于在企业战略和解决方案直接建立联系，从企业层面规划变革项目和解决方案，避免重复建设。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的统一语言",
      "topic-information":
        "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/tengyun.png",
      "producer-name": "滕云",
      "producer-introduction": "ThoughtWorks 高级咨询师",
      "producer-information":
        "长期从事一线编码与技术指导工作，曾经多次参与能源、金融、保险等大型软件系统的研发与重构。从2013年以来，一直致力于DDD在软件项目中的落地实践与推广培训，当前正参与某会员系统的DDD引入和微服务改造工作。曾多次在行业会议上担任讲师分享DDD相关内容，译有《实现领域驱动设计》和《人件》等书。",
      "producer-topic": "事件驱动架构落地",
      "topic-information":
        "领域事件是DDD中一个重要的概念，在微服务蔚然成风的当下，事件驱动架构(EDA)已经成为解耦微服务的利器，围绕着领域事件的事件溯源(Event Sourcing)与CQRS也开始被行业所采纳。在本次分享中，我将讲到在微服务场景下使用领域事件的诸多方面，包括在微服务中使用领域事件的基本逻辑，领域事件的设计与组成，发送和消费领域事件的不同方式以及各自的优缺点。本次分享会以我本人工作过的实际项目为例，着重讲解由于采用了领域事件而导致的分布式系统的数据一致性问题。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的架构演进",
      "topic-information":
        "过去的5年中，领域驱动设计在架构设计过程中的重要作用逐渐被业界主流所接受。无论是微服务架构、演进式架构、还是企业IT架构设计、企业中台设计，我们都可能看到领域驱动设计在各个架构设计层面发挥着自己的价值。我们希望通过本论坛的研讨，为听众呈现一场架构设计的盛宴，让大家能全方位的理解领域驱动设计的价值和威力"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/zhangjuanchen.png",
      "producer-name": "张镌宸",
      "producer-introduction": "ThoughtWorks 高级咨询师",
      "producer-information":
        "ThoughtWorks车企数字化解决方案架构师，帮助知名车企完成经销商系统服务化改造与数字化零售平台的设计，拥有丰富的车企零售数字化产品设计与解决方案设计的经验。",
      "producer-topic": "汽车零售数字化平台的落地与演进",
      "topic-information":
        "面对日益升级的消费者需求，面对不断变化的市场趋势，面对持续加入的新势力竞争对手，车企如何做到快速响应变化，完成零售与售后服务的数字化转型？平台化的思维是解决问题的关键。如何结合汽车零售的业务特点，从核心业务切入，逐渐将汽车零售数字化平台落地并持续治理与演进，是本方案的核心内容。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的架构演进",
      "topic-information":
        "过去的5年中，领域驱动设计在架构设计过程中的重要作用逐渐被业界主流所接受。无论是微服务架构、演进式架构、还是企业IT架构设计、企业中台设计，我们都可能看到领域驱动设计在各个架构设计层面发挥着自己的价值。我们希望通过本论坛的研讨，为听众呈现一场架构设计的盛宴，让大家能全方位的理解领域驱动设计的价值和威力"
    }
  ],
  [
    {
      "producer-img": "../resource/speakers/zhaoqian.png",
      "producer-name": "赵谦",
      "producer-introduction": "北京百拓开源科技有限公司 业务总监",
      "producer-information":
        "20年的中国企业信息化经验，多年的erp咨询顾问，2012年转向新技术体系的信息信息化交付邻域，曾交付国内第一个基于sap hana的烟草销售领域的管控平台项目，后转向基于开源组件的业务中台领域，带领团队开发了互联网架构的paas平台，也提出了基于领域驱动的企业中台交付的实施方法论，并在多个头部企业进行项目落地。",
      "producer-topic": "基于领域设计的企业中台实施方法论",
      "topic-information":
        "告知企业管理曾为什么要上中台，适合才能建立适应未来快速、且不确定的业务支撑系统。打造可复用的组件，是提升企业效率，降低创业难度的最佳能力。基于领域设计的中台实施方法论，将中台的概念转化为可执行的企业架构与能力复用平台。"
    },
    {
      "producer-information": "...",
      "producer-topic": "领域驱动的统一语言",
      "topic-information":
        "统一语言是领域驱动设计的核心概念。Eric Evans提出在战术层面实现领域驱动设计的前提，是在一个限界上下文之内构建领域统一语言。在不同的组织中，统一语言的含义和构建过程都不尽相同。在本分论坛中，我们将聚焦统一语言在不同上下文中的确切含义和价值，剖析统一语言的实现模式"
    }
  ]
];
